pub mod library;
use library as ОдинУ;

irzha::irzha! {
    вжити ОдинУ::*;

    публічна структура Модель {
        лічильник: з32,
    }

    #[автореалізація(Повідомлення)]
    публічна перелік Повідомлення {
        Декрементувати,
        Інкрементувати,
        Вихід,
    }

    вжити власна::Повідомлення::*;

    #[віджет]
    реалізація Віджет для МійДодаток {
        вигляд! {
            гтк::Вікно {
                гтк::Коробка {
                    орієнтація: Вертикальна,
                    гтк::Кнопка {
                        натиснуто => Інкрементувати,
                        заголовок: "+",
                    },
                    гтк::Заголовок {
                        текст: &власна.модель.лічильник.to_string(),
                    },
                    гтк::Кнопка {
                        натиснуто => Декрементувати,
                        заголовок: "-",
                    },
                },
                подія_видалення(_, _) => (Вихід, Перешкодження(false)),
            }
        }

        функція оновити(&змінна власна, подія: Повідомлення) {
            порівняти подія {
                Декрементувати => власна.модель.лічильник -= 1,
                Інкрементувати => власна.модель.лічильник += 1,
                Вихід => вихід(),
            }
        }

        функція модель() -> Модель {
            Модель {
                лічильник: 0,
            }
        }
    }

    функція основна() {
        МійДодаток::запуск(()).очікувати("Запуск МійДодаток не вдався");
    }
}
